cfe/src/DataProcessors/ИИ_Ассистент.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<DataProcessor>
		<Properties>
			<Name>ИИ_Ассистент</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

cfe/src/InformationRegisters/ИИ_НастройкиПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>ИИ_НастройкиПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючНастройки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cfe/src/InformationRegisters/ИИ_ИсторияЧатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>ИИ_ИсторияЧатов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИИ_РолиСообщений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСообщения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сессия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИИ_СессииЧатов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cfe/src/Enums/ИИ_РолиСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ИИ_РолиСообщений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Пользователь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ассистент</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cfe/src/Catalogs/ИИ_СессииЧатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>ИИ_СессииЧатов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтекстОбъектаJSON</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		<Attribute>
			<Properties>
				<Name>ОбъектКонтекста</Name>
				<Comment>Объект, к которому привязана контекстная сессия чата.</Comment>
				<Type>
					<v8:Type>cfg:DefinedType.ИИ_ТипыОбъектовКонтекстныхЗапросов</v8:Type>
				</Type>
			</Properties>
		</Attribute>

			<Attribute>
				<Properties>
					<Name>Контекстный</Name>
					<Comment>Признак того, что сессия привязана к контексту объекта.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cfe/src/DataProcessors/ИИ_Ассистент/Forms/ФормаЧата/Ext/Form/Module.bsl
#Область ОписаниеПеременных

// Хранит текст последнего вопроса пользователя для возможности повтора запроса.
&НаКлиенте
Перем ТекстПоследнегоВопроса;

#КонецОбласти
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АдресШлюза = Константы.ИИ_АдресШлюза.Получить();
	ТаймаутЗапроса = Константы.ИИ_ТаймаутЗапроса.Получить();
	ИнтервалОпроса = Константы.ИИ_ИнтервалОпроса.Получить();
	Если ИнтервалОпроса < 2 Тогда
		ИнтервалОпроса = 2;
	КонецЕсли;
	МаксимальныйРазмерВложения = Константы.ИИ_МаксимальныйРазмерВложения.Получить();
	Если МаксимальныйРазмерВложения = 0 Тогда
		МаксимальныйРазмерВложения = 10;
	КонецЕсли;
	МаксимальноеКоличествоСообщенийКонтекста = Константы.ИИ_МаксимальноеКоличествоСообщенийКонтекста.Получить();
	Если МаксимальноеКоличествоСообщенийКонтекста = 0 Тогда
		МаксимальноеКоличествоСообщенийКонтекста = 20;
	КонецЕсли;
	ПромптПодсказка = РегистрыСведений.ИИ_НастройкиПользователей.ПолучитьПромптПодсказкуПользователя();
	HTMLДокументШаблон = ПолучитьШаблонHTMLДокументаНаСервере();
	
	Если Параметры.Свойство("ОбъектКонтекста") Тогда
		ОбъектКонтекста = Параметры.ОбъектКонтекста;
	КонецЕсли;
	Если Параметры.Свойство("КонтекстОбъектаJSON") Тогда
		КонтекстОбъектаJSON = Параметры.КонтекстОбъектаJSON;
	КонецЕсли;
	
	Если Параметры.Свойство("Сессия") И ЗначениеЗаполнено(Параметры.Сессия) Тогда
		ТекущаяСессия = Параметры.Сессия;
		ЗагрузитьКонтекстСессии(ТекущаяСессия);
	Иначе
		Контекстный = ЗначениеЗаполнено(ОбъектКонтекста)
			Или ЗначениеЗаполнено(КонтекстОбъектаJSON);
	КонецЕсли;
	
	ЗагрузитьСписокСессий();
	
	Если Не ЗначениеЗаполнено(ТекущаяСессия) Тогда
		Если СписокСессий.Количество() = 0 Тогда
			СоздатьНовуюСессию();
			Возврат;
		Иначе
			ТекущаяСессия = СписокСессий[0].Сессия;
		КонецЕсли;
	КонецЕсли;
	
	Контекстный = ЗначениеЗаполнено(ОбъектКонтекста)
		Или ЗначениеЗаполнено(КонтекстОбъектаJSON);
	
	ЗагрузитьИсториюСессии();
	ОбновитьЗаголовокКонтекста();
	
КонецПроцедуры
&НаКлиенте
Процедура ОбработкаПриОткрытии(Отказ)
	
	УстановитьКартинкуКнопкиОтправить();
	УстановитьТекущуюСессиюВСписке();
	ОбновитьОтображениеВложений();
	
КонецПроцедуры
&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	// При закрытии формы принудительно завершаем активный запрос к шлюзу,
	// чтобы не оставлять висящую генерацию на сервере.
	ОстановитьГенерацию();
	
КонецПроцедуры
&НаКлиенте
Процедура УстановитьТекущуюСессиюВСписке()
	
	Если СписокСессий.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ВосстановитьТекущуюСтрокуСписка(ТекущаяСессия);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЗаголовокКонтекста()
	
	Если Не Контекстный Тогда
		Заголовок = "ИИ Ассистент";
		Возврат;
	КонецЕсли;
	
	ПредставлениеКонтекста = "Контекст объекта";
	Если ЗначениеЗаполнено(КонтекстОбъектаJSON) Тогда
		Попытка
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(КонтекстОбъектаJSON);
			ДанныеКонтекста = ПрочитатьJSON(ЧтениеJSON);
			Если ДанныеКонтекста.Свойство("presentation") Тогда
				ПредставлениеКонтекста = ДанныеКонтекста.presentation;
			КонецЕсли;
			Если ДанныеКонтекста.Свойство("synonym") И ЗначениеЗаполнено(ДанныеКонтекста.synonym) Тогда
				ПредставлениеКонтекста = ПредставлениеКонтекста + " (" + ДанныеКонтекста.synonym + ")";
			ИначеЕсли ДанныеКонтекста.Свойство("name") И ЗначениеЗаполнено(ДанныеКонтекста.name) Тогда
				ПредставлениеКонтекста = ПредставлениеКонтекста + " (" + ДанныеКонтекста.name + ")";
			Иначе
				// Дополнительная информация о типе объекта не указана.
			КонецЕсли;
		Исключение
			ПредставлениеКонтекста = "Контекст объекта";
		КонецПопытки;
	КонецЕсли;
	
	Заголовок = "ИИ Ассистент - " + ПредставлениеКонтекста;
	
КонецПроцедуры
&НаКлиенте
Процедура ОткрытьСессию(Знач Сессия) Экспорт
	
	Если Не ЗначениеЗаполнено(Сессия) Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьСписокСессийНаКлиенте();
	ТекущаяСессия = Сессия;
	ВосстановитьТекущуюСтрокуСписка(ТекущаяСессия);
	ЗагрузитьИсториюСессии();
	УстановитьФокусВПолеВвода();
	
КонецПроцедуры
#КонецОбласти
#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	ДанныеТекущейСтроки = Элементы.СписокСессий.ТекущиеДанные;
	Если ДанныеТекущейСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НовоеНаименование = СокрЛП(ДанныеТекущейСтроки.Наименование);
	Если Не ЗначениеЗаполнено(НовоеНаименование) Тогда
		ЗагрузитьСписокСессий();
		Возврат;
	КонецЕсли;
	
	СохранитьНаименованиеСессииНаСервере(ДанныеТекущейСтроки.Сессия, НовоеНаименование);
	
КонецПроцедуры
&НаКлиенте
Процедура СообщенияHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ДанныеСобытия = Неопределено Или Не ДанныеСобытия.Свойство("Element") Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементHTML = ДанныеСобытия.Element;
	Если ЭлементHTML = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Действие = НайтиАтрибутВИерархии(ЭлементHTML, "data-action");
	Если ЗначениеЗаполнено(Действие) Тогда
		Если Действие = "continue" Тогда
			ОтправитьСообщениеПользователя("продолжай");
		ИначеЕсли Действие = "retry" Тогда
			ТекстДляПовтора = НайтиАтрибутВИерархии(ЭлементHTML, "data-text");
			Если Не ЗначениеЗаполнено(ТекстДляПовтора) Тогда
				ТекстДляПовтора = ТекстПоследнегоВопроса;
			КонецЕсли;
			Если ЗначениеЗаполнено(ТекстДляПовтора) Тогда
				ОтправитьСообщениеПользователя(ТекстДляПовтора, Истина);
			КонецЕсли;
		Иначе
			// Действие не распознано - игнорируем.
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Идентификатор = НайтиАтрибутВИерархии(ЭлементHTML, "data-copy-id");
	Если Не ЗначениеЗаполнено(Идентификатор) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстСообщенияДляКопирования = НайтиТекстСообщенияПоИдентификатору(ТекущаяСессия, Идентификатор);
	Если Не ЗначениеЗаполнено(ТекстСообщенияДляКопирования) Тогда
		Возврат;
	КонецЕсли;
	
	Если СредстваБуфераОбмена.ИспользованиеДоступно() Тогда
		ЭлементБуфера = Новый ЭлементБуфераОбмена(СтандартныйФорматДанныхБуфераОбмена.Текст, ТекстСообщенияДляКопирования);
		Оповещение = Новый ОписаниеОповещения("СообщенияHTMLПриНажатииЗавершениеКопирования", ЭтотОбъект);
		СредстваБуфераОбмена.НачатьПомещениеДанных(Оповещение, ЭлементБуфера);
	КонецЕсли;
	
КонецПроцедуры
// Завершение асинхронного помещения текста сообщения в буфер обмена.
//
// Параметры:
//  Результат - Булево, ИнформацияОбОшибке - результат помещения данных.
//  ДополнительныеПараметры - Произвольный - не используется.
//
&НаКлиенте
Процедура СообщенияHTMLПриНажатииЗавершениеКопирования(Результат, ДополнительныеПараметры) Экспорт
	
	// Действий после копирования не требуется.
	
КонецПроцедуры
#КонецОбласти
#Область ОбработчикиСобытийЭлементовТаблицыФормы_СписокСессий
&НаКлиенте
Процедура СписокСессийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	УстановитьТекущуюСессиюИзСписка();
	
КонецПроцедуры
&НаКлиенте
Процедура СписокСессийПриАктивизацииСтроки(Элемент)
	
	УстановитьТекущуюСессиюИзСписка();
	
КонецПроцедуры
&НаКлиенте
Процедура УстановитьТекущуюСессиюИзСписка()
	
	Если ОбновлениеСпискаСессий Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеТекущейСтроки = Элементы.СписокСессий.ТекущиеДанные;
	Если ДанныеТекущейСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВыбраннаяСессия = ДанныеТекущейСтроки.Сессия;
	Если ВыбраннаяСессия = ТекущаяСессия Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСессия = ВыбраннаяСессия;
	ЗагрузитьКонтекстИИсториюСессииНаСервере(ТекущаяСессия);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьКонтекстИИсториюСессииНаСервере(Знач Сессия)
	
	ЗагрузитьКонтекстСессии(Сессия);
	ЗагрузитьИсториюСессии();
	ОбновитьЗаголовокКонтекста();
	
КонецПроцедуры
#КонецОбласти
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура НовыйЧатОбработка(Команда)
	
	СоздатьНовуюСессию();
	ВосстановитьТекущуюСтрокуСписка(ТекущаяСессия);
	УстановитьФокусВПолеВвода();
	
КонецПроцедуры
&НаКлиенте
Процедура ОтправитьСообщениеПользователя(Знач Текст, Знач ЭтоПовтор = Ложь)
	
	ТекстСообщения = Текст;
	ОтправитьОбработка(Неопределено, ЭтоПовтор);
	
КонецПроцедуры
&НаКлиенте
Процедура ОтправитьОбработка(Команда = Неопределено, Знач ЭтоПовтор = Ложь)
	
	Если ИдетГенерация Тогда
		ОстановитьГенерацию();
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекстСообщения) И Вложения.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущаяСессия) Тогда
		СоздатьНовуюСессию();
	КонецЕсли;
	
	СессияТекущегоЗапроса = ТекущаяСессия;
	ТекстВопроса = ТекстСообщения;
	ТекстПоследнегоВопроса = ТекстВопроса;
	ТекстСообщения = "";
	УстановитьФокусВПолеВвода();
	
	Если Не ЭтоПовтор
		Или Не ЕстьСообщениеПользователяВСессииНаСервере(СессияТекущегоЗапроса, ТекстВопроса) Тогда
		СохранитьСообщениеПользователяНаСервере(СессияТекущегоЗапроса, ТекстВопроса);
	КонецЕсли;
	
	ВложенияДляОтправки = Новый Массив;
	Для Каждого СтрокаВложения Из Вложения Цикл
		ОписаниеВложения = Новый Структура("ИмяФайла, MimeType, ДанныеBase64");
		ОписаниеВложения.ИмяФайла = СтрокаВложения.ИмяФайла;
		ОписаниеВложения.MimeType = СтрокаВложения.MimeType;
		ОписаниеВложения.ДанныеBase64 = СтрокаВложения.ДанныеBase64;
		ВложенияДляОтправки.Добавить(ОписаниеВложения);
	КонецЦикла;
	
	УстановитьРежимГенерации(Истина);
	ЗагрузитьИсториюСессии();
	ОбновитьПолеСообщений();
	
	Если Не ЭтоПовтор Тогда
		ОбновитьСписокСессийНаКлиенте();
	КонецЕсли;
	
	ИсторияДляШлюза = ПолучитьИсториюСессииДляШлюзаНаСервере(СессияТекущегоЗапроса);
	
	ИдентификаторЗапроса = "";
	АдресХранилищаЗапроса = "";
	
	Попытка
		Таймаут = ?(ТаймаутЗапроса = 0, 30, ТаймаутЗапроса);
		
		ДанныеЗапуска = ИИ_АссистентСервер.ЗапуститьЗапросКШлюзу(
			АдресШлюза,
			Таймаут,
			ТекстВопроса,
			ИсторияДляШлюза,
			КонтекстОбъектаJSON,
			ПромптПодсказка,
			ВложенияДляОтправки,
			ТекущаяСессия);
		
		ИдентификаторЗапроса = ДанныеЗапуска.ИдентификаторЗадания;
		АдресХранилищаЗапроса = ДанныеЗапуска.АдресХранилища;
		
		Вложения.Очистить();
		ОбновитьОтображениеВложений();
	Исключение
		Если ИдетГенерация Тогда
			СообщенияHTML = ПолучитьИсториюСессииДляHTMLНаСервере(
				СессияТекущегоЗапроса,
				"",
				Ложь,
				"",
				"Ошибка при запуске запроса: " + ОбработкаОшибок.ПредставлениеОшибкиДляПользователя(ИнформацияОбОшибке()),
				ТекстПоследнегоВопроса);
			ЗавершитьГенерацию(Ложь);
		КонецЕсли;
		Возврат;
	КонецПопытки;
	
	// Запущено фоновое задание - подключаем регулярный опрос статуса.
	Если ИдетГенерация И ЗначениеЗаполнено(ИдентификаторЗапроса) Тогда
		ПодключитьОбработчикОжидания("ПроверитьСтатусЗапроса", ИнтервалОпроса, Ложь);
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура УдалитьСессиюОбработка(Команда)
	
	Если Не ЗначениеЗаполнено(ТекущаяСессия) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЕстьСообщенияВСессииНаСервере(ТекущаяСессия) Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеВопросаОбУдалении", ЭтотОбъект);
		ТекстВопроса = "В выбранной сессии есть переписка. Удалить сессию?";
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ПослеВопросаОбУдалении(КодВозвратаДиалога.Да, Неопределено);
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ПрикрепитьКартинкуОбработка(Команда)
	
	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов(
		"Выберите изображение",
		Истина,
		"Изображения|*.png;*.jpg;*.jpeg;*.gif;*.bmp;*.webp");
	
	Оповещение = Новый ОписаниеОповещения("ПослеПомещенияКартинок", ЭтотОбъект);
	НачатьПомещениеФайловНаСервер(Оповещение, Неопределено, Неопределено, ПараметрыДиалога, УникальныйИдентификатор);
	
КонецПроцедуры
// Обработчик завершения помещения выбранных изображений во временное хранилище.
// Работает в тонком клиенте и веб-клиенте.
//
// Параметры:
//  ПомещенныеФайлы - Массив, Неопределено - описания помещённых файлов или Неопределено при отмене.
//  ДополнительныеПараметры - Произвольный - дополнительные параметры обработчика оповещения.
//
&НаКлиенте
Процедура ПослеПомещенияКартинок(ПомещенныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ПомещенныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	АдресаФайлов = Новый Массив;
	ОписанияФайлов = Новый Соответствие;
	Для Каждого ОписаниеФайла Из ПомещенныеФайлы Цикл
		Если ОписаниеФайла.ПомещениеФайлаОтменено Тогда
			Продолжить;
		КонецЕсли;
		
		АдресаФайлов.Добавить(ОписаниеФайла.Адрес);
		ОписанияФайлов.Вставить(ОписаниеФайла.Адрес, ОписаниеФайла.СсылкаНаФайл);
	КонецЦикла;
	
	Если АдресаФайлов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеВложений = ПолучитьДанныеВложенийНаСервере(АдресаФайлов);
	
	МаксимальныйРазмерБайт = МаксимальныйРазмерВложения * 1024 * 1024;
	ПревышившиеРазмер = Новый Массив;
	
	Для Каждого Элемент Из ДанныеВложений Цикл
		СсылкаНаФайл = ОписанияФайлов.Получить(Элемент.Адрес);
		Если СсылкаНаФайл = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если МаксимальныйРазмерБайт > 0 И Элемент.Размер > МаксимальныйРазмерБайт Тогда
			ПревышившиеРазмер.Добавить(СсылкаНаФайл.Имя);
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = Вложения.Добавить();
		НоваяСтрока.ИмяФайла = СсылкаНаФайл.Имя;
		НоваяСтрока.MimeType = MimeTypeПоРасширению(СсылкаНаФайл.Расширение);
		НоваяСтрока.ДанныеBase64 = Base64ВОднуСтроку(Элемент.ДанныеBase64);
	КонецЦикла;
	
	Если ПревышившиеРазмер.Количество() > 0 Тогда
		ТекстСообщения = СтрШаблон("Следующие файлы превышают максимальный размер (%1 МБ) и не добавлены:%2%3",
			МаксимальныйРазмерВложения,
			Символы.ПС,
			СтрСоединить(ПревышившиеРазмер, Символы.ПС));
		ИИ_АссистентКлиент.ПоказатьСообщениеОбОшибке(ТекстСообщения);
	КонецЕсли;
	
	ОбновитьОтображениеВложений();
	
КонецПроцедуры

// Получает двоичные данные вложений из временного хранилища на сервере.
//
// Параметры:
//  АдресаФайлов - Массив - адреса во временном хранилище.
//
// Возвращаемое значение:
//  Массив - структуры с полями Адрес, ДанныеBase64, Размер.
//
&НаСервереБезКонтекста
Функция ПолучитьДанныеВложенийНаСервере(Знач АдресаФайлов)
	
	Результат = Новый Массив;
	Для Каждого Адрес Из АдресаФайлов Цикл
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(Адрес);
		Если ДвоичныеДанные = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Результат.Добавить(Новый Структура("Адрес, ДанныеBase64, Размер",
			Адрес,
			Base64Строка(ДвоичныеДанные),
			ДвоичныеДанные.Размер()));
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции
&НаКлиенте
Функция MimeTypeПоРасширению(Знач Расширение)
	
	Расширение = НРег(Расширение);
	Если Расширение = ".png" Тогда
		Возврат "image/png";
	ИначеЕсли Расширение = ".jpg" Или Расширение = ".jpeg" Тогда
		Возврат "image/jpeg";
	ИначеЕсли Расширение = ".gif" Тогда
		Возврат "image/gif";
	ИначеЕсли Расширение = ".bmp" Тогда
		Возврат "image/bmp";
	ИначеЕсли Расширение = ".webp" Тогда
		Возврат "image/webp";
	Иначе
		Возврат "image/png";
	КонецЕсли;
	
КонецФункции
// Убирает из Base64-строки переводы строк, которые добавляет функция Base64Строка.
// API модели требует данные в одну строку без разделителей.
//
// Параметры:
//  Base64 - Строка - исходная Base64-строка с переводами строк.
//
// Возвращаемое значение:
//  Строка - Base64-строка в одну строку.
//
&НаКлиенте
Функция Base64ВОднуСтроку(Знач Base64)
	
	Возврат СтрСоединить(СтрРазделить(Base64, Символы.ПС + Символы.ВК, Ложь), "");
	
КонецФункции
&НаКлиенте
Процедура ОбновитьОтображениеВложений()
	
	КоличествоВложений = Вложения.Количество();
	Элементы.ГруппаВложенияИнфо.Видимость = (КоличествоВложений > 0);
	
	Если КоличествоВложений = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ВложенияИнфо.Заголовок = СтрШаблон("Вложения: %1", КоличествоВложений);
	
	ИменаФайлов = Новый Массив;
	Для Каждого СтрокаВложения Из Вложения Цикл
		ИменаФайлов.Добавить(СтрокаВложения.ИмяФайла);
	КонецЦикла;
	Элементы.ВложенияИнфо.РасширеннаяПодсказка.Заголовок = СтрСоединить(ИменаФайлов, Символы.ПС);
	
КонецПроцедуры
&НаКлиенте
Процедура ОчиститьВложенияОбработка(Команда)
	
	Вложения.Очистить();
	ОбновитьОтображениеВложений();
	
КонецПроцедуры
&НаКлиенте
Процедура ПослеВопросаОбУдалении(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		УдаляемаяСессия = ТекущаяСессия;
		
		Если ИдетГенерация И УдаляемаяСессия = СессияТекущегоЗапроса Тогда
			ОстановитьГенерацию();
		КонецЕсли;
		
		ИИ_АссистентСервер.УдалитьСессию(УдаляемаяСессия);
		ТекущаяСессия = ПредопределенноеЗначение("Справочник.ИИ_СессииЧатов.ПустаяСсылка");
		ОбновитьСписокСессийНаКлиенте();
		Если СписокСессий.Количество() > 0 Тогда
			ТекущаяСессия = СписокСессий[0].Сессия;
			ВосстановитьТекущуюСтрокуСписка(ТекущаяСессия);
			ЗагрузитьИсториюСессии();
		Иначе
			ИсторияHTML = "";
			ТекущийОтветHTML = "";
			СообщенияHTML = ПустойHTMLДокумент();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти
#Область СлужебныеПроцедурыИФункции
#Область СлужебныеПроцедурыИФункции_Клиент
&НаКлиенте
Процедура ОбновитьСписокСессийНаКлиенте()
	
	ОбновлениеСпискаСессий = Истина;
	ЗагрузитьСписокСессий();
	ВосстановитьТекущуюСтрокуСписка(ТекущаяСессия);
	ОбновлениеСпискаСессий = Ложь;
	
КонецПроцедуры
&НаКлиенте
Процедура ВосстановитьТекущуюСтрокуСписка(Знач Сессия)
	
	Для Каждого СтрокаСписка Из СписокСессий Цикл
		Если СтрокаСписка.Сессия = Сессия Тогда
			Элементы.СписокСессий.ТекущаяСтрока = СтрокаСписка.ПолучитьИдентификатор();
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
&НаКлиенте
Процедура ОбновитьСтатус(Знач Ответ, Знач Завершено) Экспорт
	
	Если Не ЗначениеЗаполнено(СессияТекущегоЗапроса) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущаяСессия <> СессияТекущегоЗапроса Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Ответ) Тогда
		ТекущийОтветHTML = СформироватьHTMLТекущегоОтветаНаСервере(Ответ);
	КонецЕсли;
	ОбновитьПолеСообщений();
	
	Если Завершено Тогда
		ЗавершитьГенерацию(Ложь);
		ЗагрузитьИсториюСессии();
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Функция НайтиАтрибутВИерархии(Знач ЭлементHTML, Знач ИмяАтрибута)
	
	ТекущийЭлементHTML = ЭлементHTML;
	Пока ТекущийЭлементHTML <> Неопределено Цикл
		ЗначениеАтрибута = Неопределено;
		Попытка
			ЗначениеАтрибута = ТекущийЭлементHTML.getAttribute(ИмяАтрибута);
		Исключение
			ЗначениеАтрибута = Неопределено;
		КонецПопытки;
		Если ЗначениеЗаполнено(ЗначениеАтрибута) Тогда
			Возврат ЗначениеАтрибута;
		КонецЕсли;
		Попытка
			ТекущийЭлементHTML = ТекущийЭлементHTML.parentNode;
		Исключение
			Прервать;
		КонецПопытки;
	КонецЦикла;
	
	Возврат "";
	
КонецФункции
&НаКлиенте
Процедура ЗавершитьГенерацию(Знач ПерезагрузитьИсторию = Истина) Экспорт
	
	СброситьСостояниеГенерации();
	Если ПерезагрузитьИсторию Тогда
		ОбновитьСписокСессийНаКлиенте();
		ЗагрузитьИсториюСессии();
	КонецЕсли;
	
КонецПроцедуры
// Сбрасывает реквизиты текущего запроса и признак генерации.
// Вызывается из глобального обработчика ожидания при завершении запроса,
// даже если форма неактивна или выбран другой чат.
//
&НаКлиенте
Процедура СброситьСостояниеГенерации() Экспорт
	
	ОтключитьОбработчикОжидания("ПроверитьСтатусЗапроса");
	Если ЗначениеЗаполнено(АдресХранилищаЗапроса) Тогда
		УдалитьИзВременногоХранилища(АдресХранилищаЗапроса);
	КонецЕсли;
	ИдентификаторЗапроса = "";
	АдресХранилищаЗапроса = "";
	СессияТекущегоЗапроса = ПредопределенноеЗначение("Справочник.ИИ_СессииЧатов.ПустаяСсылка");
	УстановитьРежимГенерации(Ложь);
	
КонецПроцедуры
// Останавливает активную генерацию по команде пользователя.
// Отменяет фоновое задание и сбрасывает режим генерации.
//
&НаКлиенте
Процедура ОстановитьГенерацию()
	
	ОтключитьОбработчикОжидания("ПроверитьСтатусЗапроса");
	
	ТекущийИдентификатор = ИдентификаторЗапроса;
	ТекущийАдресХранилища = АдресХранилищаЗапроса;
	ИдентификаторЗапроса = "";
	АдресХранилищаЗапроса = "";
	СессияТекущегоЗапроса = ПредопределенноеЗначение("Справочник.ИИ_СессииЧатов.ПустаяСсылка");
	ТекущийОтветHTML = "";
	УстановитьРежимГенерации(Ложь);
	
	Если ЗначениеЗаполнено(ТекущийАдресХранилища) Тогда
		УдалитьИзВременногоХранилища(ТекущийАдресХранилища);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущийИдентификатор) Тогда
		Возврат;
	КонецЕсли;
	
	ИИ_АссистентСервер.ОтменитьФоновоеЗадание(ТекущийИдентификатор);
	
КонецПроцедуры
// Проверяет статус фонового задания и обновляет форму при завершении.
// Вызывается через обработчик ожидания.
//
&НаКлиенте
Процедура ПроверитьСтатусЗапроса() Экспорт
	
	Если Не ИдетГенерация Или Не ЗначениеЗаполнено(ИдентификаторЗапроса) Тогда
		ОтключитьОбработчикОжидания("ПроверитьСтатусЗапроса");
		Возврат;
	КонецЕсли;
	
	Результат = ИИ_АссистентСервер.ПроверитьФоновоеЗадание(ИдентификаторЗапроса, АдресХранилищаЗапроса);
	
	Если Результат.Статус = "Выполняется" Тогда
		ОбновитьПолеСообщений();
		Возврат;
	КонецЕсли;
	
	ОтключитьОбработчикОжидания("ПроверитьСтатусЗапроса");
	ИдентификаторЗапроса = "";
	ТекущийАдресХранилища = АдресХранилищаЗапроса;
	АдресХранилищаЗапроса = "";
	
	Если ЗначениеЗаполнено(ТекущийАдресХранилища) Тогда
		УдалитьИзВременногоХранилища(ТекущийАдресХранилища);
	КонецЕсли;
	
	Если Результат.Статус = "Завершено" И Результат.Успешно Тогда
		СессияДляОповещения = СессияТекущегоЗапроса;
		СохранитьФинальноеСообщениеНаСервере(СессияТекущегоЗапроса, Результат.Ответ);
		ЗавершитьГенерацию(Истина);
		ПоказатьОповещениеПользователя(
			"Ответ готов",
			Новый ОписаниеОповещения("ОбработкаНажатияОповещения", ЭтотОбъект, Новый Структура("Сессия", СессияДляОповещения)),
			"ИИ-ассистент подготовил ответ",
			БиблиотекаКартинок.Информация,
			СтатусОповещенияПользователя.Информация);
	Иначе
		СообщениеОбОшибке = ?(ЗначениеЗаполнено(Результат.СообщениеОбОшибке),
			Результат.СообщениеОбОшибке,
			"Ошибка получения ответа от шлюза.");
		СообщенияHTML = ПолучитьИсториюСессииДляHTMLНаСервере(
			СессияТекущегоЗапроса,
			"",
			Ложь,
			"",
			СообщениеОбОшибке,
			ТекстПоследнегоВопроса);
		ЗавершитьГенерацию(Ложь);
	КонецЕсли;
	
КонецПроцедуры
// Обработчик нажатия на оповещение пользователя о полученном ответе модели.
//
// Параметры:
//  ДополнительныеПараметры - Структура - должна содержать свойство "Сессия".
//
&НаКлиенте
Процедура ОбработкаНажатияОповещения(ДополнительныеПараметры) Экспорт
	
	Если ДополнительныеПараметры = Неопределено
		Или Не ДополнительныеПараметры.Свойство("Сессия") Тогда
		Возврат;
	КонецЕсли;
	
	Сессия = ДополнительныеПараметры.Сессия;
	Если Не ЗначениеЗаполнено(Сессия) Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьСессию(Сессия);
	ЭтотОбъект.Активизировать();
	
КонецПроцедуры
&НаКлиенте
Процедура УстановитьРежимГенерации(Знач Значение)
	
	ИдетГенерация = Значение;
	Элементы.ТекстСообщения.Доступность = Не Значение;
	Элементы.ПрикрепитьКартинку.Доступность = Не Значение;
	УстановитьКартинкуКнопкиОтправить();
	
КонецПроцедуры
// Возвращает список фраз, которые поочерёдно показываются во время ожидания ответа модели.
//
// Возвращаемое значение:
//  Массив - фразы ожидания.
//
&НаКлиенте
Функция ФразыОжидания()
	
	Результат = Новый Массив;
	Результат.Добавить("Нагружаю видеокарты знаниями людей...");
	Результат.Добавить("Жду ответа от Скайнета...");
	Результат.Добавить("Перевожу с человеческого на нейронками...");
	Результат.Добавить("Собираю мысли в кучу...");
	Результат.Добавить("Шаманю над трансформерами...");
	Результат.Добавить("Кормлю хомяка в колесе прогресса...");
	Результат.Добавить("Ищу ответ в матрице...");
	Результат.Добавить("Перевожу с человеческого на машинный...");
	Результат.Добавить("Загружаю мозг в облако...");
	Результат.Добавить("Варю кашу из нейронов...");
	Результат.Добавить("Подключаюсь к Всемирному Разуму...");
	Результат.Добавить("Убеждаю ИИ, что это важный вопрос...");
	Результат.Добавить("Переписываю запрос семью слоями...");
	Результат.Добавить("Прошу совета у волшебного шара...");
	Результат.Добавить("Заправляю кофе в генеративную модель...");
	Результат.Добавить("Рожаю идею в муках творчества...");
	Результат.Добавить("Перебираю биты в поисках смысла...");
	Результат.Добавить("Спрашиваю у кота Шрёдингера...");
	Результат.Добавить("Гадаю на кофейной гуще алгоритмов...");
	Результат.Добавить("Ловлю мысли бабочкой в сети...");
	Результат.Добавить("Пряду ответ из ниток вероятностей...");
	Результат.Добавить("Взвешиваю варианты на весах энтропии...");
	Результат.Добавить("Собираю паззл из токенов...");
	Результат.Добавить("Плаваю в океане эмбеддингов...");
	Результат.Добавить("Настраиваю антенну на волну инсайтов...");
	Результат.Добавить("Слушаю шепот больших данных...");
	Результат.Добавить("Кручу ручку генератора случайностей...");
	Результат.Добавить("Прошу совета у цифрового оракула...");
	Результат.Добавить("Варю ответ в котле глубокого обучения...");
	Результат.Добавить("Ловлю зайца в поле нейросетей...");
	Результат.Добавить("Считаю звёзды на небе LLM...");
	Результат.Добавить("Убеждаю нейроны не лениться...");
	Результат.Добавить("Разгоняю трансформеры до сверхзвуковой скорости...");
	Результат.Добавить("Пытаюсь убедить модель, что 1С - это искусство...");
	Результат.Добавить("Загружаю конфигурацию в сознание модели...");
	Результат.Добавить("Перевариваю синонимы метаданных...");
	Результат.Добавить("Собираю ответ по крупицам из терабайтов...");
	Результат.Добавить("Прошу модель не фантазировать...");
	Результат.Добавить("Ищу истину между строк запроса...");
	Результат.Добавить("Склеиваю токены скотчем внимания...");
	Результат.Добавить("Перевожу с BSL на человеческий...");
	Результат.Добавить("Запускаю хомяков на полную мощность...");
	Результат.Добавить("Пытаюсь разглядеть смысл в матрице весов...");
	Результат.Добавить("Советуюсь с совестью модели...");
	Результат.Добавить("Добываю ответ из недр внимания...");
	Результат.Добавить("Перемалываю данные в муку знаний...");
	Результат.Добавить("Строю мосты между вопросом и ответом...");
	Результат.Добавить("Настраиваю антенну на волну 1С-инсайтов...");
	Результат.Добавить("Угощаю модель печеньками с контекстом...");
	
	Возврат Результат;
	
КонецФункции
// Возвращает случайную фразу ожидания из списка.
//
// Возвращаемое значение:
//  Строка - случайная фраза ожидания.
//
&НаКлиенте
Функция СлучайнаяФразаОжидания()
	
	Фразы = ФразыОжидания();
	Если Фразы.Количество() = 0 Тогда
		Возврат "Думаю...";
	КонецЕсли;
	
	Индекс = ТекущаяУниверсальнаяДатаВМиллисекундах() % Фразы.Количество();
	Возврат Фразы[Индекс];
	
КонецФункции
// Опрашивает статус потокового запроса к шлюзу, обновляет индикатор загру
&НаКлиенте
Процедура УстановитьКартинкуКнопкиОтправить()
	
	Если ИдетГенерация Тогда
		Элементы.Отправить.Картинка = БиблиотекаКартинок.Остановить;
	Иначе
		Элементы.Отправить.Картинка = БиблиотекаКартинок.ОтправитьСообщение;
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура УстановитьФокусВПолеВвода()
	
	ТекущийЭлемент = Элементы.ТекстСообщения;
	
КонецПроцедуры
// Возвращает пустой HTML-документ.
//
// Возвращаемое значение:
//  Строка - пустой HTML-документ.
//
&НаКлиенте
Функция ПустойHTMLДокумент()
	
	Возврат "<!DOCTYPE html><html><head><meta charset='utf-8'></head><body></body></html>";
	
КонецФункции
// Обновляет поле СообщенияHTML, склеивая историю, текущий ответ и индикатор загрузки.
//
// Параметры:
//  ФразаОжидания - Строка - фраза для индикатора загрузки.
//
&НаКлиенте
Процедура ОбновитьПолеСообщений(Знач ФразаОжидания = "")
	
	Индикатор = "";
	Если ИдетГенерация Тогда
		ТекстФразы = ?(ЗначениеЗаполнено(ФразаОжидания), ФразаОжидания, СлучайнаяФразаОжидания());
		Индикатор = "<div class='message assistant'><div class='assistant-text loading'>" + ТекстФразы + "</div></div>";
	КонецЕсли;
	
	СообщенияHTML = ОбернутьТелоВHTMLДокументНаКлиенте(ИсторияHTML + ТекущийОтветHTML + Индикатор);
	
КонецПроцедуры
#КонецОбласти
#Область СлужебныеПроцедурыИФункции_Сервер
&НаСервереБезКонтекста
Функция ПолучитьИсториюСессииДляШлюзаНаСервере(Знач Сессия)
	
	Возврат ИИ_АссистентСервер.ПолучитьИсториюСессииДляШлюза(Сессия);
	
КонецФункции
&НаСервереБезКонтекста
Функция ПолучитьИсториюСессииДляHTMLНаСервере(
	Знач Сессия,
	Знач ТекстАссистента,
	Знач ПоказыватьИндикаторЗагрузки = Ложь,
	Знач ФразаОжидания = "",
	Знач ТекстОшибки = "",
	Знач ТекстДляПовтора = "")
	
	История = ИИ_АссистентСервер.ПолучитьИсториюСессии(Сессия);
	
	Если ЗначениеЗаполнено(ТекстАссистента) Тогда
		НоваяСтрока = История.Добавить();
		НоваяСтрока.Роль = Перечисления.ИИ_РолиСообщений.Ассистент;
		НоваяСтрока.ТекстСообщения = ТекстАссистента;
		НоваяСтрока.ИдентификаторСообщения = "pending";
		НоваяСтрока.ДатаСообщения = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Возврат ИИ_АссистентСервер.СформироватьHTMLСообщений(
		История, ПоказыватьИндикаторЗагрузки, ФразаОжидания, ТекстОшибки, ТекстДляПовтора);
	
КонецФункции
&НаСервереБезКонтекста
Функция ЕстьСообщенияВСессииНаСервере(Знач Сессия)
	
	Возврат ИИ_АссистентСервер.ЕстьСообщенияВСессии(Сессия);
	
КонецФункции
&НаСервереБезКонтекста
Функция ЕстьСообщениеПользователяВСессииНаСервере(Знач Сессия, Знач ТекстСообщения)
	
	Возврат РегистрыСведений.ИИ_ИсторияЧатов.ЕстьСообщениеПользователя(Сессия, ТекстСообщения);
	
КонецФункции
&НаСервереБезКонтекста
Процедура СохранитьСообщениеПользователяНаСервере(Знач Сессия, Знач ТекстСообщения)
	
	ИИ_АссистентСервер.СохранитьСообщение(Сессия, Перечисления.ИИ_РолиСообщений.Пользователь, ТекстСообщения);
	
	Если ЭтоПервоеСообщениеПользователя(Сессия) Тогда
		НовоеНаименование = ИИ_АссистентСервер.СформироватьНаименованиеСессии(ТекстСообщения, ТекущаяДатаСеанса());
		СохранитьНаименованиеСессииНаСервере(Сессия, НовоеНаименование);
	КонецЕсли;
	
КонецПроцедуры
&НаСервереБезКонтекста
Функция ЭтоПервоеСообщениеПользователя(Знач Сессия)
	
	Возврат РегистрыСведений.ИИ_ИсторияЧатов.ЭтоПервоеСообщениеПользователя(Сессия);
	
КонецФункции
&НаСервереБезКонтекста
Процедура СохранитьНаименованиеСессииНаСервере(Знач Сессия, Знач Наименование)
	
	Если Не ЗначениеЗаполнено(Сессия) Тогда
		Возврат;
	КонецЕсли;
	
	СессияОбъект = Сессия.ПолучитьОбъект();
	Если СессияОбъект = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СессияОбъект.Наименование = Наименование;
	СессияОбъект.Записать();
	
КонецПроцедуры
&НаСервереБезКонтекста
Процедура СохранитьФинальноеСообщениеНаСервере(Знач Сессия, Знач ТекстСообщения)
	
	ИИ_АссистентСервер.СохранитьСообщение(Сессия, Перечисления.ИИ_РолиСообщений.Ассистент, ТекстСообщения);
	
КонецПроцедуры
&НаСервере
Процедура ЗагрузитьСписокСессий()
	
	СписокСессий.Очистить();
	ТаблицаСессий = ИИ_АссистентСервер.ПолучитьСписокСессий(,
		Контекстный,
		ОбъектКонтекста);
	
	Для Каждого Строка Из ТаблицаСессий Цикл
		НоваяСтрока = СписокСессий.Добавить();
		НоваяСтрока.Сессия = Строка.Сессия;
		НоваяСтрока.Наименование = Строка.Наименование;
	КонецЦикла;
	
КонецПроцедуры
&НаСервере
Процедура ЗагрузитьКонтекстСессии(Знач Сессия)
	
	Если Не ЗначениеЗаполнено(Сессия) Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектКонтекста = Сессия.ОбъектКонтекста;
	КонтекстОбъектаJSON = Сессия.КонтекстОбъектаJSON;
	Контекстный = ЗначениеЗаполнено(ОбъектКонтекста)
		Или ЗначениеЗаполнено(КонтекстОбъектаJSON);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьИсториюСессии()
	
	Если Не ЗначениеЗаполнено(ТекущаяСессия) Тогда
		ИсторияHTML = "";
		ТекущийОтветHTML = "";
		СообщенияHTML = "<!DOCTYPE html><html><head><meta charset='utf-8'></head><body></body></html>";
		Возврат;
	КонецЕсли;
	
	История = ИИ_АссистентСервер.ПолучитьИсториюСессии(ТекущаяСессия);
	ИсторияHTML = ИИ_АссистентСервер.СформироватьТелоHTMLСообщений(История);
	
	Если Не (ИдетГенерация И ТекущаяСессия = СессияТекущегоЗапроса) Тогда
		ТекущийОтветHTML = "";
	КонецЕсли;
	
	СообщенияHTML = ИИ_АссистентСервер.ОбернутьТелоВHTMLДокумент(ИсторияHTML + ТекущийОтветHTML);
	
КонецПроцедуры
&НаСервере
Процедура СоздатьНовуюСессию()
	
	ТекущаяСессия = ИИ_АссистентСервер.СоздатьСессию(
		"", КонтекстОбъектаJSON, ОбъектКонтекста);
	ЗагрузитьСписокСессий();
	ЗагрузитьИсториюСессии();
	ОбновитьЗаголовокКонтекста();
	
КонецПроцедуры
&НаСервереБезКонтекста
Функция НайтиТекстСообщенияПоИдентификатору(Знач Сессия, Знач Идентификатор)
	
	Возврат РегистрыСведений.ИИ_ИсторияЧатов.ТекстСообщенияПоИдентификатору(Сессия, Идентификатор);
	
КонецФункции
&НаКлиенте
Процедура РедактироватьПромптПодсказкуОбработка(Команда)
	
	ОткрытьФорму("DataProcessor.ИИ_Ассистент.Form.ФормаНастроек");
	
КонецПроцедуры
&НаСервереБезКонтекста
Функция СформироватьHTMLТекущегоОтветаНаСервере(Знач ТекстОтвета)
	
	Возврат ИИ_АссистентСервер.СформироватьHTMLТекущегоОтвета(ТекстОтвета);
	
КонецФункции
&НаСервереБезКонтекста
Функция ОбернутьТелоВHTMLДокументНаСервере(Знач Тело)
	
	Возврат ИИ_АссистентСервер.ОбернутьТелоВHTMLДокумент(Тело);
	
КонецФункции
&НаСервереБезКонтекста
Функция ПолучитьШаблонHTMLДокументаНаСервере()
	
	Возврат СтрЗаменить(ИИ_АссистентСервер.ОбернутьТелоВHTMLДокумент(""), "<div id='messages'></div>", "<div id='messages'>{ТЕЛО}</div>");
	
КонецФункции
&НаКлиенте
Функция ОбернутьТелоВHTMLДокументНаКлиенте(Знач Тело)
	
	Возврат СтрЗаменить(HTMLДокументШаблон, "{ТЕЛО}", Тело);
	
КонецФункции
#КонецОбласти
#КонецОбласти
